## =======================================================
## 파일 입출력 - with ~ as구문
##              파일 close() 자동 처리
## =======================================================
## ---------------------------------
## 전역 변수
## ---------------------------------
FILE_PATH = 'new_data.txt'

## ---------------------------------
## 파일 읽기
## ---------------------------------
## (1) 열기
with open(FILE_PATH, "r", encoding="utf8") as F:
    all_data = F.read()
print(f"all_data : {all_data}")

#  (2) 쓰기
with open(FILE_PATH, "w", encoding="utf8") as F:
    F.write("Good Luck\n")
