# =================================================
# 			Pandas : 필터링과 자료형 변환
# =================================================

# [사용 파일]
# - students_records.json

# [학습 범위]
# - 불린 인덱싱
# - isin()
# - query()
# - astype()
# - pd.to_numeric()
# - pd.to_datetime()

# [ 문제 유형 ]
# - 문제 1~10은 필터링 복습 문제입니다.
# - 문제 11~20은 자료형 변환 복습 문제입니다.
# - 문제 20은 자료형 변환과 필터링을 함께 복습하는 종합 문제입니다.
import pandas as pd
DATA_FILE = r'C:\Users\Win11Pro\Desktop\KDT-14\[2]PANDAS\DATA\students_records.json'
std_df = pd.read_json(DATA_FILE)
print(std_df,"\n")

# #########################################################
# #				필터링 문제 10개                                              #
# #########################################################
# =================================================
# 문제 1. score가 90점 이상인 학생만 출력하세요.
# =================================================
print(std_df[std_df['score'] >=90],"\n")

# =================================================
# 문제 2. age가 21세 이상인 학생만 출력하세요.
# =================================================
print(std_df.query("age >= 21"),"\n")

# =================================================
# 문제 3. gender가 "여"인 학생만 출력하세요.
# =================================================
print(std_df.query("gender == '여'"),"\n")

# =================================================
# 문제 4. major가 "데이터분석"인 학생만 출력하세요.
# =================================================
print(std_df.query("major == '데이터분석'"),"\n")

# =================================================
# 문제 5. score가 80점 이상이고 gender가 "여"인 학생만 출력하세요.
# =================================================
print(std_df[(std_df['score'] >=90) & (std_df['gender'] == '여')],"\n")

# =================================================
# 문제 6. age가 21세 이상이고 score가 90점 이상인 학생의 name, age, score 
#           컬럼만 출력하세요.
# =================================================
result = std_df[(std_df['age'] >= 21) & (std_df['score'] >= 90)][['name', 'age', 'score']]
print(result,"\n")

# =================================================
# 문제 7. isin()을 사용하여 major가 "데이터분석" 또는 "인공지능"인 학생만 
#           출력하세요.
# =================================================
major = std_df[std_df['major'].isin(['데이터분석', '인공지능'])]
print(major,"\n")

# =================================================
# 문제 8. isin()을 사용하여 name이 "김민수", "최유진", "정다은" 중 하나인 
#           학생만 출력하세요.
# =================================================
major = std_df[std_df['name'].isin(['김민수', '최유진', '정다은'])]
print(major,"\n")

# =================================================
# 문제 9. query()를 사용하여 score가 90점 이상인 학생만 출력하세요.
# =================================================
print(std_df.query("score >= 90"),"\n")

# =================================================
# 문제 10. query()를 사용하여 age가 21세 이상이고 score가 85점 이상인 
#             학생만 출력하세요.
# =================================================
print(std_df.query("score >= 85 and age == 21"),"\n")


# #########################################################
# #				자료형 변환 문제 10개                                       #
# #########################################################
# =================================================
# 문제 11. 각 컬럼의 자료형을 확인하세요.
# =================================================
print(std_df.dtypes, "\n")

# =================================================
# 문제 12. id 컬럼의 자료형을 문자열형(str)으로 변환한 후 자료형을 확인하세요.
# =================================================
std_df['id'] = std_df['id'].astype('str')
print(f'id 컬럼의 자료형{std_df.dtypes["id"]}\n')

# =================================================
# 문제 13.  age 컬럼의 자료형을 int8로 변환한 후 자료형을 확인하세요.
# =================================================
std_df['age'] = std_df['age'].astype('int8')
print(f'age 컬럼의 자료형{std_df.dtypes["age"]}\n')

# =================================================
# 문제 14. score 컬럼의 자료형을 float으로 변환한 후 자료형을 확인하세요.
# =================================================
std_df['score'] = std_df['score'].astype('float')
print(f'score 컬럼의 자료형{std_df.dtypes["score"]}\n')

# =================================================
# 문제 15.  score 컬럼을 astype(str)을 사용하여 문자열형으로 변환하세요.
#              그 후 자료형을 확인하세요.
# =================================================
std_df['score'] = std_df['score'].astype('str')
print(f'score 컬럼의 자료형{std_df.dtypes["score"]}\n')

# =================================================
# 문제 16.  문자열형으로 변환된 score 컬럼을 pd.to_numeric()을 사용하여 
#               다시 숫자형으로 변환하세요.
#               그 후 자료형을 확인하세요.
# =================================================
std_df['score'] = pd.to_numeric(std_df['score'])
print(f'score 컬럼의 자료형{std_df.dtypes["score"]}\n')

# =================================================
# 문제 17. age 컬럼을 문자열형으로 변환한 후, pd.to_numeric()을 사용하여 
#             다시 숫자형으로 변환하세요.
# =================================================
std_df['age'] = std_df['age'].astype('str')
print(f'age 컬럼의 자료형{std_df.dtypes["age"]}\n')
std_df['age'] = pd.to_numeric(std_df['age'])
print(f'age 컬럼의 자료형{std_df.dtypes["age"]}\n')

# =================================================
# 문제 18. 다음 코드를 실행하여 score 컬럼에 잘못된 문자열 값을 추가하세요.
#              df.loc[5] = [6, "테스트", "남", 24, "컴퓨터공학", "점수없음", "2026-03-10"]
#              그 후 pd.to_numeric()의 errors="coerce"를 사용하여 숫자로 변환할 
#              수 없는 값을 NaN으로 처리하세요.
# =================================================
std_df.loc[5] = [6, "테스트", "남", 24, "컴퓨터공학", "점수없음", "2026-03-10"]
std_df['score'] = pd.to_numeric(std_df['score'], errors='coerce')
print(f'score 컬럼\n{std_df["score"]}\n')

# =================================================
# 문제 19.  join_date 컬럼을 pd.to_datetime()을 사용하여 날짜형으로 변환하세요.
#            그 후 자료형을 확인하세요.
# =================================================
std_df['join_date'] = pd.to_datetime(std_df['join_date'])
print(f'join_date 컬럼 자료형{std_df.dtypes["join_date"]}\n')

# =================================================
# 문제 20. join_date 컬럼을 날짜형으로 변환한 후, 가입일이 2026-03-05 이후인 
#            학생만 출력하세요.
std_df['join_date'] = pd.to_datetime(std_df['join_date'])
result = std_df['join_date'] > '2026-03-05'
print(f'join_date 컬럼 자료형\n{std_df[result]}\n')

# MLB API(json) 판다스로 추출 연습
import requests
DATA_FILE = "https://statsapi.mlb.com/api/v1/teams?sportId=1"
response = requests.get(DATA_FILE).json()
mlb_df = pd.json_normalize(response['teams'])

# 볼만한 정보만 전처리
mlb_df = mlb_df[['teamName', 'locationName','firstYearOfPlay',
                 'league.name', 'division.name']]
print(mlb_df.head(),'\n')
print(mlb_df.dtypes,'\n')

# 창립년도 형변환
mlb_df['firstYearOfPlay'] = mlb_df['firstYearOfPlay'].astype('int')
print(mlb_df.dtypes['firstYearOfPlay'],'\n')

# 창립년도 1950년 이상
mlb_filtered = mlb_df.query("firstYearOfPlay >= 1950")
print(mlb_filtered[['teamName', 'firstYearOfPlay']])
