## ===========================================
## DataFrame 행(row)과 열(column) 컬럼 다루기
## -------------------------------------------
## * 행 선택 : df변수명.iloc[정수 위치인덱스]
## *          df변수명.loc[라벨 인덱스]
## * 열 선택 : df변수명[컬럼이름]
## *        : df변수명.컬럼이름. => 컬럼이름 = str
## ===========================================
## -------------------------------------------
## [1] 모듈 로딩
## -------------------------------------------
import pandas as pd 

## -------------------------------------------
## [2] DataFrame 인스턴스 생성
## -------------------------------------------
## 데이터 준비
datas = [[11, 33,55,77], 
         [2, 22, 4, 44], 
         ['A',10,'B',0]]

## DataFrame 인스턴스 생성
df = pd.DataFrame(datas,
                  index = ["1번","2번","3번"],
                  columns=['A','B','C','D'])

## -------------------------------------------
## [3] DataFrame 인스턴스 속성 읽기
## -------------------------------------------
print('- DataFrame 기본 속성들 -')
print(f'* index   : {df.index}')    # 표/데이터프레임 행 식별 인덱스
print(f'* columns : {df.columns}')  # 표/데이터프레임 열(컬럼) 식별
print(df)  

## -------------------------------------------
## [4] 열/컬럼 선택
##     df변수명[컬럼이름]
##     => 컬럼이름 지정 시 위치 인덱스 지원 X
## -------------------------------------------
print("\n---컬럼 선택---")
print("2번 컬럼 선택 : ", type(df["C"]))
# print(df[2]) # 이름 지정시 Error
print(df["C"])
print(df.D) # 컬럼 1개만 가능 / 컬럼명 = str만 가능

## -------------------------------------------
## [5] 행/로우 선택
## -------------------------------------------
print("\n---행 선택---")
print("2번 행 선택 : ", type(df.iloc[2]))
print(df.iloc[2])

print("2번 행 선택 : ", type(df.loc["3번"]))
print(df.loc["3번"])



