## ==============================================================
# DataFrame/Series에서 행/열/원소 추가/수정
## ==============================================================
# [1] 모듈/패키지 로딩
import pandas as pd

# [2] DataFrame 인스턴스 생성
df = pd.DataFrame([[10, 20, 30, 40.],
                  [11, 22, 33, 44.]],
                  columns=['영','일','이','삼'],
                  index=['row0', 'row1'])
print("===df", df,sep="\n")

# -----------------------------------------------------------------
# [3] Series 원소 추가/수정
# -> 추가 : 변수명[인덱스] = 원소값
# ->       변수명.loc[인덱스] = 원소값
# ->       변수명.iloc[인덱스] = 원소값 <== 불가
# -----------------------------------------------------------------
dataSR = df.loc['row0']
print("dataSR 원본---", dataSR, sep='\n')

# [3-1] 원소 추가 
dataSR['사']=100
dataSR.loc[5]=55
print("\ndataSR 추가본---", dataSR, sep='\n')

# 원소에 위치를 부여하는 방식 원소추가 사용불가
# iloc()

# [3-2] 원소 수정/변경
dataSR['영']=10
dataSR.loc[5]=5
dataSR.iloc[3]=35
print("\ndataSR 수정본---", dataSR, sep='\n')

# -----------------------------------------------------------------
# [4] DataFrame 행/열 추가, 행/열/원소 수정
# -> 추가 : 변수명[인덱스] = [원소값,...]
# ->       변수명.loc[인덱스] = [원소값,...]
# ->       변수명.iloc[인덱스] = [원소값,...]
# -----------------------------------------------------------------
# [4-1] 행 추가
df.loc['row2'] = [44, 33, 22, 11]
print("df 원본---", df, sep='\n')











