## ==============================================================
## 인덱스 관련 메서드들 (1) set_index()
## ==============================================================
## 인덱스 목적 : 1행 / 관측값 추출하기 위한 용도
##            : 유일한 값. 반드시 값이 존재해야 함
## ==============================================================
# [1] 모듈/패키지 로딩
import pandas as pd

# [2] DataFrame 인스턴스 생성
df = pd.DataFrame({'A': [10,20,30],
                   'B': [8, 11, 7],
                   'C': [9, 5, 8 ],
                   'D': [11, 7, 4]})
print("===df", df,sep="\n")

# -----------------------------------------------------------------
# [3] 특정 컬럼 => 행 인덱스 설정
# -> df.set_index()
# -----------------------------------------------------------------
c_df = df.set_index('A')
print("\n===c_df", c_df,sep="\n")
print(c_df.index)
print("\n===c_df", c_df.loc[10],sep="\n")

# df.set_index([컬럼,...])
# 멀티 인덱스
c_df = df.set_index(['A','B'])
print("\n===c_df", c_df,sep="\n")
print(c_df.index)
print("===c_df\n", c_df.loc[(10,8)],sep="")
