## ==============================================================
## 인덱스 관련 메서드들 (2) reset_index()
## ==============================================================
## 기존 인덱스 => 컬럼으로 옮기고
##              정수형 위치 인덱스로 초기화
## ==============================================================
# [1] 모듈/패키지 로딩
import pandas as pd

# [2] DataFrame 인스턴스 생성
df = pd.DataFrame({'A': [10,20,30],
                   'B': [8, 11, 7],
                   'C': [9, 5, 8 ],
                   'D': [11, 7, 4]})
print("===df", df,sep="\n")

# -----------------------------------------------------------------
# [3] DataFrame 인덱스 설정
#     3행 4열 ==> one, two, three
# -----------------------------------------------------------------
df.index = ['one','two','three']
print("===df", df,sep="\n")

# -----------------------------------------------------------------
# [4] DataFrame 인덱스 초기화
# -----------------------------------------------------------------
c_df = df.reset_index()
print("===c_df", c_df,sep="\n")

c_df = c_df.drop(columns='index')
print("===c_df", c_df,sep="\n")

c_df = df.reset_index(drop=True)
print("===c_df", c_df,sep="\n")
