## ==============================================================
# DataFrame에서 행/열 선택
## ==============================================================
# 
## ==============================================================
# [1] 모듈/패키지 로딩
import pandas as pd

# [2] DataFrame 인스턴스 생성
df1 = pd.DataFrame([[10, 20, 30, 40.],
                        [11, 22, 33, 44.]])

df2 = pd.DataFrame([[10, 20, 30, 40.],
                        [11, 22, 33, 44.]],
                        columns=['영','일','이','삼'],
                        index=['row0', 'row1'])

print("===df1", df1,sep="\n")
print("\n===df2",df2,sep="\n")

# [3] 열(column/세로) 선택
# [3-1] 1개 열 선택
# print("\n===row0",df2[0],sep="\n")
print("\n===일",df2['일'],sep="\n")

# 컬럼 명이 없으므로 위치 인덱스 사용 가능
print("\n===2번째",df1[1],sep="\n")

# [3-2] 2개 이상 열 선택 - 인덱스 리스트
print("\n===영",df2[['삼','일']],sep="\n")

# 컬럼 명이 있으므로 사용불가
# print("\n===영",df2[[3,1]],sep="\n")
print("\n===2번째",df1[[1,2]],sep="\n")

# [3-3] 2개 이상 열 선택 -인덱스 슬라이싱
print("\n===1~3",df2.loc[:,'일':'삼'],sep="\n")

print("\n===1,3",df2.loc[:,'일':'삼':2],sep="\n")

print("\n===1~3",df2.iloc[:],sep="\n")


