## ==============================================================
# DataFrame에서 행/열 원소 선택
## ==============================================================
# 
## ==============================================================
# [1] 모듈/패키지 로딩
import pandas as pd

# [2] DataFrame 인스턴스 생성
df1 = pd.DataFrame([[10, 20, 30, 40.],
                        [11, 22, 33, 44.]])

df2 = pd.DataFrame([[10, 20, 30, 40.],
                        [11, 22, 33, 44.]],
                        columns=['영','일','이','삼'],
                        index=['row0', 'row1'])

print("===df1", df1,sep="\n")
print("\n===df2",df2,sep="\n")

# [3] 행(row/가로) 선택
# [3-1] 1개 행 선택
print("\n===row0",df2.iloc[0],sep="\n")
print("\n===row0",df2.loc['row0'],sep="\n")

# [3-2] 2개 이상 행 선택 - 인덱스 리스트
print("\n===row0,1",df2.iloc[[0,1]],sep="\n")
print("\n===row0,1",df2.loc[['row0','row1']],sep="\n")

# [3-3] 2개 이상 행 선택 -인덱스 슬라이싱
print("\n===row0,1",df2.iloc[:],sep="\n")
print("\n===row0,1",df2.loc['row0':'row1'],sep="\n")





