## ==============================================================
## 정렬(sort)
## ==============================================================
## ==> 인덱스 기준 정렬 : sort_index()
## ==> 데이터 기준 정렬 : sort_values()
## ==============================================================
# [1] 모듈/패키지 로딩
import pandas as pd, numpy as np

# [2] DataFrame 인스턴스 생성
# 결측치/값이 없는 빈칸/Missig Value
# 표현 Nan, NaT, NA, nan, nt, na
df = pd.DataFrame({'Z': [10,20,30],
                   'F': [8, 11, 7],
                   'A': [9, 5, 8 ],
                   'D': [11, 7, 4],
                   'G': [10, np.nan, 30],
                   'O': [pd.NA, pd.NA, pd.NA]})
print("===df", df,sep="\n")

# -----------------------------------------------------------------
# [3] DataFrame 인덱스 설정
#     3행 4열
# -----------------------------------------------------------------
df.index = ['ㅎ','ㄷ','ㄱ']
print("===df", df,sep="\n")

# -----------------------------------------------------------------
# [4] 인덱스 정렬
# -----------------------------------------------------------------
# 행 인덱스 정렬
n_df = df.sort_index()
print("===n_df", n_df,sep="\n")

# 열 인덱스 정렬 : axis='columns' or 1
n_df = df.sort_index(axis='columns')
print("===n_df", n_df,sep="\n")

# -----------------------------------------------------------------
# [5] 데이터 정렬 : sort_values(by=컬럼)
# -----------------------------------------------------------------
n_df = df.sort_values(by="A")
print("===n_df", n_df,sep="\n")

n_df = df.sort_values(by=["A","G"])
print("===n_df", n_df,sep="\n")

# ignore_index = True 매개변수 : 정렬 후 기존 인덱스 무시하고 새롭게 정수 위치 인덱싱
n_df = df.sort_values(by=["G","A"], ignore_index=True)
print("===n_df", n_df,sep="\n")
